In [2]:
import numpy as np
import pandas as pd

In [4]:
np.nan

nan

In [6]:
pd.NaT

NaT

In [8]:
np.nan is np.nan

True

In [10]:
myvar = np.nan

In [12]:
myvar is np.nan

True

In [24]:
df = pd.read_csv("C:\\Users\\ply58\\PythonML\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\movie_scores.csv")

In [26]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [28]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [30]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [32]:
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [34]:
df[df['pre_movie_score'].isnull()]

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [38]:
df[df['pre_movie_score'].isnull() & df['first_name'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [40]:
#KEEP DATA

In [42]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [44]:
#DROP DATA

In [52]:
df.dropna(thresh = 1) #the value of thresh is used to drop the rows that don't have less than <1> non-NA value

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [54]:
df.dropna(thresh = 5) #the value of thresh is used to drop the rows that don't have less than <5> non-NA value

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [56]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [62]:
df.dropna(axis = 0) #drop the rows

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [64]:
df.dropna(axis = 1) #drop the columns

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [66]:
df.dropna(subset='last_name')

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [68]:
df.fillna('No') #fill the value 'No' to the pos that have NA values

  first_name last_name   age sex pre_movie_score post_movie_score
0        Tom     Hanks  63.0   m             8.0             10.0
1         No        No    No  No              No               No
2       Hugh   Jackman  51.0   m              No               No
3      Oprah   Winfrey  66.0   f             6.0              8.0
4       Emma     Stone  31.0   f             7.0              9.0

In [70]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [72]:
df['pre_movie_score'] = df['pre_movie_score'].fillna('Not a Number')

In [74]:
df

  first_name last_name   age  sex pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m             8.0              10.0
1        NaN       NaN   NaN  NaN    Not a Number               NaN
2       Hugh   Jackman  51.0    m    Not a Number               NaN
3      Oprah   Winfrey  66.0    f             6.0               8.0
4       Emma     Stone  31.0    f             7.0               9.0

In [88]:
df = pd.read_csv("C:\\Users\\ply58\\PythonML\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\movie_scores.csv")
df['pre_movie_score'].mean()

np.float64(7.0)

In [90]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [94]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [130]:
airline_tix = {'first': 100, 'bussiness': np.nan, 'economy-plus': 50, 'economy': 30}

In [132]:
ser = pd.Series(airline_tix)

In [134]:
ser

first           100.0
bussiness         NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [136]:
ser.notna().mean()

np.float64(0.75)

In [138]:
ser.interpolate

<bound method NDFrame.interpolate of first           100.0
bussiness         NaN
economy-plus     50.0
economy          30.0
dtype: float64>

In [140]:
ser['bussiness']

np.float64(nan)

In [142]:
ser['bussiness'] = ser.notna().mean()

In [144]:
ser['bussiness']

np.float64(0.75)

In [146]:
ser

first           100.00
bussiness         0.75
economy-plus     50.00
economy          30.00
dtype: float64